Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/the_asylum_process_in_ireland/refugees_and_asylum_seekers.html.txt.tmx
Source language: en
Languages: ga

source: International protection – an overview
ga: Cosaint idirnáisiúnta - achoimre

source: If you have arrived in Ireland and you want to apply for international protection (refugee status or subsidiary protection), you need to know about the legal process for doing so
ga: Más rud é gur tháinig tú i dtír in Éirinn agus gur mhian leat iarratas a dhéanamh ar chosaint idirnáisiúnta (stádas dídeanaí nó cosaint choimhdeach), tá sé riachtanach go mbeadh eolas agat ar an bpróiseas dlíthiúil chun é sin a dhéanamh

source: You need to know about the rights and obligations of asylum seekers and the different legal statuses of asylum seekers and refugees
ga: Ní foláir go mbeadh eolas agat ar chearta agus ar dhualgais iarrthóirí tearmainn agus ar stádais éagsúla dlíthiúla a bheith ag iarrthóirí tearmainn agus ag dídeanaithe

source: (Note: the International Protection Act 2015 introduces new terminology but, for clarity, we will continue to use the terms “asylum” and “asylum seeker” as well.)
ga: (Tabhair faoi deara: úsáideann an tAcht um Chosaint Idirnáisiúnta 2015, téarmaíocht nua ach, ar mhaithe le soiléireacht, úsáidfimid na téarmaí "tearmann" agus "iarrthóir tearmainn" chomh maith)

source: You can find out about applying for international protection, how applications for international protection are assessed, information and services for asylum seekers in direct provision, medical services for asylum seekers, legal aid for asylum seekers, education for refugees, family reunification for people granted refugee status or subsidiary protection, medical and social welfare services and entitlements for refugees and travel documents for refugees
ga: Is féidir leat eolas a fháil maidir le hiarratas a dhéanamh ar chosaint idirnáisiúnta, conas a mheastar iarratais ar chosaint idirnáisiúnta, eolas agus seirbhísí do iarrthóirí tearmainn in Éirinn atá i soláthar díreach, seirbhísí leighis d'iarrthóiri tearmainn, cúnamh dlíthiúil d’iarrthóirí tearmainn, oideachas do dhídeanaithe, athaontú teaghlaigh do dhídeanaithe do dhaoine ar bronnadh stádas dídeanaí nó cosaint choimhdeach orthu, teidlíochtaí leighis agus leasa shóisialaigh do dhídeanaithe agus doiciméid taistil do dhídeanaithe

source: In addition, the Dublin III Regulation may affect your application for refugee status and you need to be informed about this
ga: Lena chois sin, d’fhéadfadh Rialachán Bhaile Átha Cliath III dul i bhfeidhm ar d’iarratas ar stádas dídeanaí agus tá sé riachtanach tú a chur ar an eolas faoi

source: You will also need to know what to do if your application for international protection is refused
ga: Ní foláir go mbeadh fios agat freisin ar céard ba chóir a dhéanamh sa chás go ndiúltófar le d’iarratas ar chosaint idirnáisiúnta

source: Another useful source of information is decisions made by the Minister for Justice and Equality
ga: Foinse úsáideach eolais eile iad cinntí a thóg an tAire Dlí agus Cirt agus Comhionannais

source: If you wish to withdraw your application for refugee status, you will find the information you need in withdrawing from the international protection process
ga: Más mian leat d’iarratas ar stádas dídeanaí a tharraingt siar, gheobhaidh tú an t-eolas atá uait chun tarraingt siar ón bpróiseas iarrtha ar chosaint idirnáisiúnta anseo
